# Assignment: An Introduction to SQL

## Goals of the Assignment

   1. Explore a database
   2. Basic querying: select data from a table
   3. Selecting specific attributes of a table
   4. Filtering with the "where" clause
   5. Aggregation functions: counting
   6. Aggregation functions: Using AVG for averaging
   7. Intervals, ranges, and sorting
   8. Subqueries
   9. Window functions

We suggest that you fork the repo containing this notebook into your private Github and then clone it to your local machine, so you can edit your own local version of this notebook. That way you can enter your solutions into your local version, save, and push them back to your private Github.

## Basic Assignment Tasks

### Part 1: Make sure your Docker PostgreSQL server is running

If you haven't done so yet, follow [these instructions](https://github.com/GalvanizeDataScience/docker/blob/master/reference/docker_postgres.md) to start the Docker container that contains PostgreSQL and a sample database called readychef with data from an internet-based meal service. It is [normalized](https://en.wikipedia.org/wiki/Database_normalization), which is a way of ensuring that data is stored no more than once in a database. This avoids inconsistency and saves space. 

The readychef database has five tables: events, meals, referrals, users, and visits. The events table contains actions users have done at the site (bought, liked, or shared meals). It has four fields: the event (bought, share or like), the date, the user id, and the meal id.

The meals table contains the meal id, the type (which can be Chinese, French, etc.), the date, and the price. The users table contains the user id, the date, and the campaign id (which appears to be a two-letter abbreviation for the social media site that the user was acquired on). The referrals table contains pairs of user ids: the user who was referred and the user that referred them. Finally, the visits table contains dates and user ids representing user visits to the readychef site; a given user may have many visits.

Since it is normalized, the events table has ids for both users and meals, but in order to get the price of the meal, we have to look up that meal using its id in the meal table. By storing the price in a separate table rather than with each event, the schema enforces the rule that a given meal always costs the same amount (while saving save as a bonus). A normalized database design allows us to use _only_ the meal's ID to refer to the meal _anywhere_ it may appear, but does mean that to get meal details we almost always have to join together two tables. *As a data scientist, you will frequently write SQL queries gathering data from various tables.*

### Part 2: Connect to the Database

For this assignment we recommend using DBeaver, a GUI tool, to access the PostgreSQL database. Use DBeaver to connect to the readychef database by creating a connection to PostgreSQL, following [these instructions](dbeaver_connection.md). Use "readychef" as the database name in the connection (the default is "postgres"). The tables in this database (remember, an SQL database typically contains multiple tables) can then be viewed under the connection under "Schemas ... public ... Tables" by expanding the icon for the readychef database in the left column of DBeaver.

It is also possible to access PostgreSQL databases through Python using a module called psycopg2. Directions to do that are at the end of this assignment and will be covered in the afternoon. We encourage you to try that way of connecting when you come back to this assignment in the future.

### Part 3: `SELECT` Statements

In DBeaver, you can type and run SQL queries using the SQL Editor which is accessible through the menu bar.

1. To get an understanding of the data, run a [SELECT](https://www.w3schools.com/sql/sql_select.asp) statement on each table. Keep all the columns and limit the number of rows to 10.

Your answer:  
SELECT * FROM events LIMIT 10
same for others just swap out events for each table

(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT * FROM events LIMIT 10;
SELECT * FROM meals LIMIT 10;
SELECT * FROM referrals LIMIT 10;
SELECT * FROM users LIMIT 10;
SELECT * FROM visits LIMIT 10;
```
    
</p>
</details>

2. Write a `SELECT` statement to retrieve the user ids (only) from the events table.

Your answer:     
SELECT userid FROM events

(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT userid FROM events LIMIT 10
```
    
</p>
</details>

3. Maybe you're interested in what the campaign ids are on the users table. Use `SELECT DISTINCT` to find all the possible values of that column in the appropriate table.

*Note:*  Pinterest=PI, Facebook=FB, Twitter=TW, and Reddit=RE

Your answer:   
SELECT DISTINCT campaign_id FROM users

(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT DISTINCT campaign_id FROM users
```
    
</p>
</details>

### Part 4: Filtering using `WHERE` Clauses

Suppose we're interested in the subset of users that came from Facebook (FB). The [WHERE](https://www.w3schools.com/sql/sql_where.asp) clause can be used to add a conditional clause to `SELECT` statements. This will return those rows for which the conditional evaluates to `TRUE`. 

*Note: Make sure you put string literals in single quotes, like `campaign_id='TW'`.*

1. Using the `WHERE` clause, write a new `SELECT` statement that returns all rows where `Campaign_ID` is equal to "FB".

Your answer:   
SELECT * FROM users   
WHERE campaign_id = 'FB'

(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT * from users where campaign_id = 'FB'
```
    
</p>
</details>

2. We don't need the campaign id in the result since it doesn't vary, so modify the query to include only the other two columns.

    Your output should be something like this:


    userid|dt
    ---|---
    3|2013-01-01
    4|2013-01-01
    5|2013-01-01
    6|2013-01-01
    8|2013-01-01
    ...|

Your answer:    
SELECT userid, dt   
FROM users    
WHERE campaign_id = 'FB'
(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT userid, dt from users where campaign_id = 'FB'
```
    
</p>
</details>

### Part 5: Aggregation Functions

Let's try some [aggregation functions](https://www.postgresqltutorial.com/postgresql-aggregate-functions/) now.

`COUNT` is an example of a aggregation function.  It counts how many rows are output from a query. It works like this:

```sql
SELECT COUNT(*) FROM users;
```

Your output should look like this:


count |
--- |
5524 |

1. Write a query to get the number of users who came from Facebook.

Your answer:   
SELECT count(*) 
FROM  users    
WHERE campaign_id = 'FB'  

(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT COUNT(*) FROM users WHERE campaign_id = 'FB'
```
    
</p>
</details>

2. Now, count the number of users coming from each service. Here you will create subtotals using the column that contains the name of the service in a [GROUP BY](https://www.postgresqltutorial.com/postgresql-group-by/) clause.

Your answer:   
SELECT campagin_id, count(*)    
FROM users   
GROUP BY campaign_id  
(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT campaign_id, COUNT(*) 
    FROM users 
    GROUP BY campaign_id
```
    
</p>
</details>

Try running the query without a `GROUP BY`. PostgreSQL will tell you what to put in your group by clause!

<details><summary>Query without a GROUP BY</summary>
<p>
    
```sql
SELECT campaign_id, COUNT(*) FROM users
```
    
</p>
</details>

When you ran the command without the `GROUP BY`, you should have gotten a message saying that campaign_id has to be in a `GROUP BY` clause which should have been included in the command.

3. Use `COUNT (DISTINCT columnname)` to find the number of unique dates that appear in the `users` table.

Your answer:   
SELECT DISTINCT dt, count(*) 
FROM users    
GROUP BY dt  
   

SELECT COUNT(DISTINCT(dt))    
FROM users    
(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT COUNT(DISTINCT(dt)) FROM users
```
    
</p>
</details>

4. There are also `MAX` and `MIN` functions, which do what you would expect. Write a query to get the first and last registration dates from the `users` table.

Your answer:   
SELECT MIN(dt), MAX(dt)   
FROM users   
   
(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT MIN(dt), MAX(dt) FROM users
```
    
</p>
</details>

5. Using the `AVG` function, calculate the mean price for a meal (from the `meals` table). Your result should look like this:

    
    avg|
    ---|
    10.652283|

Your answer:   
SELECT avg(price)    
FROM meals   
  
(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT AVG(price) FROM meals
```
    
</p>
</details>

6. Now find the average, minimum, and maximum prices for each meal type. Don't forget the 'GROUP BY' statement!

    Your output should look like this:

    type | avg | min | max
    --- | --- | --- | ---
    mexican | 9.697595|6|13
    italian|11.292614|7|16
    chinese|9.518717|6|13
    french|11.542000|7|16
    japanese|9.380488|6|13
    vietnamese|9.283019|6|13
<br>

Your answer:   
SELECT type, AVG(price), MIN(price), MAX(price)  
FROM meals  
GROUP BY type  
  
(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT type, AVG(price), MIN(price), MAX(price)
    FROM meals 
    GROUP BY type
```    
</p>    
</details>

7. It's often helpful for us to give our own names to columns. We can do by using syntax such as `AVG(price) AS avg_price`. This is called [aliasing](https://www.w3schools.com/sql/sql_alias.asp). Alias all the columns from the previous exercise  so that your table looks like this:


    type | avg_price | min_price | max_price
    --- | --- | ---| ---
    mexican | 9.697595 | 6 | 13
<br>

Your answer:   

SELECT (type), AVG(price) avg_price, MIN(price) min_price, MAX(price) max_price   
FROM meals   
GROUP BY TYPE    
   
(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT type, 
       AVG(price) as avg_price, 
       MIN(price) as min_price, 
       MAX(price) as max_price 
FROM meals 
GROUP BY type 
```
    
</p>
</details>

8. Let's consider only meals which occur in the first quarter (January through March). Use PostgreSQL's `date_part` function to get the month like this: `date_part('month', dt)`. Add a `WHERE` clause to the above query to consider only meals from the first quarter of 2013 (month<=3 and year=2013).

Your answer:    
SELECT (type), AVG(price) avg_price, MIN(price) min_price, MAX(price) max_price   
FROM meals     
WHERE DATE_PART('month', dt) <= 3    
AND DATE_PART('year', dt) =2013   
GROUP BY type    

    
(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT type,
       AVG(price) as avg_price, 
       MIN(price) as min_price, 
       MAX(price) as max_price 
FROM meals 
WHERE DATE_PART('month', dt) <= 3 AND DATE_PART('year', dt) = 2013 
GROUP BY type
```
    
</p>
</details>

9. There are also scenarios where you'd want to group by more columns than one. Modify the above query so that we get the aggregate values for each month/type combination. You'll need to add the month to both the select statement and the group by statement.

    It'll be helpful to *alias* the month column and give it a name like `month` so you don't have to call the `date_time` function again in the `GROUP BY` clause. (You do need to repeat the `date_time` function in the `WHERE` clause.)

    Your result should look like this:

    type|month|avg_price|min_price|max_price
    ---|---|---|---|---
    chinese|1.0|11.230769|8|13
    chinese|2.0|9.066667|6|13
    chinese|3.0|9.250000|6|13
    french|1.0|11.650000|7|16

Your answer:    
SELECT (type), DATE_PART('month', dt) AS month, AVG(price) avg_price, MIN(price) min_price, MAX(price) max_price  
FROM meals    
WHERE DATE_PART('month', dt) <= 3 
AND DATE_PART('year', dt) =2013   
GROUP BY TYPE, month   
   
(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT type, 
       DATE_PART('month', dt) as month, 
       AVG(price) as avg_price, 
       MIN(price) as min_price, 
       MAX(price) as max_price 
FROM meals 
WHERE DATE_PART('month', dt) <= 3 AND DATE_PART('year', dt) = 2013 
GROUP BY type, DATE_PART('month', dt)    
```
    
</p>
</details>

10. Write a query using the `events` table that finds the total number of buys, likes and shares for each meal id. 

_Extra_: To avoid having to do this as three separate queries you can count the number of buys like this: `SUM(CASE WHEN event='bought' THEN 1 ELSE 0 END)`.

Your answer:   
SELECT meal_id, SUM(CASE WHEN EVENT='bought' THEN 1 ELSE 0 END) AS buys,  
				SUM(CASE WHEN EVENT='likes' THEN 1 ELSE 0 END) AS likes,  
				SUM(CASE WHEN EVENT='shares' THEN 1 ELSE 0 END) AS shares  
FROM events   
GROUP BY meal_id   
ORDER BY meal_id   
   

SELECT meal_id, EVENT, COUNT(event)     
FROM EVENTs    
GROUP BY meal_id,    
EVENT ORDER BY meal_id   
   

(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT meal_id,
       SUM(CASE WHEN event='bought' THEN 1 ELSE 0 END) as buys, 
       SUM(CASE WHEN event='like' THEN 1 ELSE 0 END) as likes,
       SUM(CASE WHEN event='share' THEN 1 ELSE 0 END) as shares
FROM events
GROUP BY meal_id
```
    
</p>
</details>

## Advanced Assignment Tasks

### Part 6: Sorting

1. Let's start with a query which finds the average price for each type of meal. It will be helpful to create an alias for the average price column, which you can call  'avg_price'.

Your answer:    
SELECT TYPE, AVG(price) Avg_Price    
FROM meals    
GROUP BY type   
   
(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT type,
       AVG(price) as avg_price
FROM meals
GROUP BY type
```
    
</p>
</details>

2. To make it easier to read, sort the results by the `type` column. You can do this with an [ORDER BY](https://www.w3schools.com/sql/sql_orderby.asp) clause.

Your answer:    
SELECT TYPE, AVG(price) Avg_Price   
FROM meals GROUP BY TYPE    
ORDER BY type
   
(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT type,
       AVG(price) as avg_price
FROM meals
GROUP BY type
ORDER BY type
```
    
</p>
</details>

3. Now return the same table again, except this time order by the price in descending order (add the `DESC` keyword).

Your answer:   
SELECT TYPE, ROUND(AVG(price), 3) Avg_Price   FROM meals    
GROUP BY TYPE    
ORDER BY Avg_Price DESC  
  
(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT type,
       AVG(price) as avg_price
FROM meals
GROUP BY type
ORDER BY type DESC
```
    
</p>
</details>

3. Sometimes we want to sort by two columns. Write a query to get all the meals, but sort by the type and then by the price. You should have an order by clause that looks something like this: `ORDER BY col1, col2`.

Your answer:   
   
SELECT TYPE, price    
FROM  meals    
ORDER BY  TYPE, price   
   
(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT type, 
       price
FROM meals
ORDER BY type, price
```
    
</p>
</details>

4. For shorthand, people sometimes use numbers to refer to the columns in their order by or group by clauses. The numbers refer to the order the columns appear  in the select statement. For instance the SQL query `SELECT type, dt FROM meals ORDER BY 1` would order the results by the `type` column.
Rewrite the query from the previous question to use this numerical syntax in the `ORDER BY` clause.

Your answer: 
   
SELECT TYPE, price    
FROM  meals    
ORDER BY  1, 2  
   
(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT type, price   
FROM meals
ORDER BY 1, 2
```
    
</p>
</details>

### Part 7: Joins

Now we are ready to do operations on multiple tables. A [JOIN](https://www.w3schools.com/sql/sql_join.asp) allows us to combine multiple tables by matching on a shared column.

1. Write a query to get one table that joins the `events` table with the `users` table (on `userid`) to create the following result.

|userid|campaign_id|meal_id|event|
|------|-----------|-------|------|
|3     |FB         |18     |bought|
|7     |PI         |1      |like|
|10    |TW         |29     |bought|
|11    |RE         |19     |share|
...|

Your answer:   

SELECT users.userid, users.campaign_id, events.meal_id, events.event   
FROM events    
INNER JOIN users ON (events.userid = users.userid)   
   
(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT users.userid,
       users.campaign_id,
       events.meal_id,
       events.event
FROM events
INNER JOIN users
ON events.userid = users.userid
```
    
</p>
</details>

2. Augment the results to also include information about the meal: the `type` and the `price`. Only include the `bought` events. The result should look like this:


userid|campaign_id|meal_id|type|price
---|---|---|---|---
3|FB|18|french|9
10|TW|29|italian|15
18|TW|40|japanese|13
22|RE|23|mexican|12
25|FB|8|french|14 
...


    If your results are different, make sure you filtered them so you only got the `bought` events. You should be able to do this *without* using a `WHERE` clause, only `ON` clause(s)! (note this has no effect on performance, and may make the query more confusing)

Your answer:   
SELECT users.userid, users.campaign_id, events.meal_id, meals.TYPE, meals.price   
FROM users   
INNER JOIN events ON (users.userid = events.userid)   
INNER JOIN meals ON (events.meal_id = meals.meal_id)   
WHERE events.EVENT = 'bought'   
    

(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT users.userid,
       users.campaign_id,
       events.meal_id,
       meals.type,
       meals.price
FROM events
INNER JOIN users
ON events.userid = users.userid
INNER JOIN meals
ON events.meal_id = meals.meal_id
AND events.event = 'bought'
```
    
</p>
</details>

3. Write a query to get how many of each type of meal were bought.

You should again be able to do this *without* a `WHERE` clause!
   
You should get the following table:

type      |total_meals_bought
----------|------------------
chinese   |6267              
french    |16179             
italian   |22575             
japanese  |6921              
mexican   |8792              
vietnamese|3535

Your answer:   
SELECT meals.TYPE, SUM(CASE WHEN events.EVENT='bought' THEN 1 ELSE 0 END) AS total_meals_bought   
FROM meals   
INNER JOIN events ON (events.meal_id = meals.meal_id)   
GROUP BY meals.TYPE    
   
(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT meals.type,
       COUNT(*) as total_meals_bought
FROM events
INNER JOIN users
ON events.userid = users.userid
INNER JOIN meals
ON events.meal_id = meals.meal_id
AND events.event = 'bought'
GROUP BY meals.type 
```
    
</p>
</details>

*Phew!* If you've made it this far, congratulations! You're ready to move on to subqueries.

### Part 8: Subqueries

In a [subquery](https://www.w3resource.com/sql/subqueries/understanding-sql-subqueries.php),  a `SELECT` statement is embedded in another `SELECT` statement.

1. Write a query to get meals that are above the average meal price.

    Start by writing a query to get the average meal price. Then write a query where you put `price > (SELECT ...)` (that select statement should return the average price). Your output should be as follows:
    
|meal_id|type   |dt        |price|
|-------|-------|----------|-----|
|2      |chinese|2013-01-01|13   |
|5      |chinese|2013-01-03|12   |
|8      |french |2013-01-03|14   |
|9      |italian|2013-01-03|13   |
|12     |mexican|2013-01-03|12   |
|15     |italian|2013-01-04|11   |
|16     |italian|2013-01-04|15   |
|...|

Your answer:  
SELECT *    
FROM meals    
WHERE price > (SELECT AVG(price)   
FROM meals)    
   
(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT *
FROM meals
WHERE price >
(SELECT AVG(price) FROM meals)
```
    
</p>
</details>

2. Write a query to get the meals that are above the average meal price *for that type*.

    Here you'll need to use a join. First write a query that gets the average meal price for each type. Then join with that table to get those meals that are larger than the average price for that type of meal. Your query should look something like this:

    ```sql
    SELECT meals.*
    FROM meals
    JOIN (SELECT ...) average
    ON ...
    ```
    Note that you need to fill in the select statement that will get the average meal price for each type. We *alias* this table and give it the name `average` (you can include the `AS` keyword, but it doesn't matter).    
    Your output should be as follows:
    
|meal_id|type   |dt        |price|type   |avg                |
|-------|-------|----------|-----|-------|-------------------|
|2      |chinese|2013-01-01|13   |chinese|9.5187165775401070 |
|5      |chinese|2013-01-03|12   |chinese|9.5187165775401070 |
|8      |french |2013-01-03|14   |french |11.5420000000000000|
|9      |italian|2013-01-03|13   |italian|11.2926136363636364|
|12     |mexican|2013-01-03|12   |mexican|9.6975945017182131 | 
|...|

Your answer:   
SELECT meals.*     
FROM meals     
INNER JOIN (SELECT TYPE, AVG(price) FROM meals GROUP BY type) avgs   
ON meals.TYPE = avgs.TYPE    
WHERE meals.price > avgs.avg      
          
(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT *
FROM meals
INNER JOIN
(SELECT type, AVG(price)
FROM meals
GROUP BY type) avgs
ON meals.type = avgs.type
WHERE meals.price > avgs.avg    
```
    
</p>
</details>

3. Modify the above query to count the number of meals of each type that are above the average price. This should be the result:

|type      |count|
|----------|-----|
|mexican   |152  |
|italian   |332  |
|french    |243  |
|chinese   |95   |
|japanese  |99   |
|vietnamese|47   |

<details><summary>Solution</summary>
<p>
    
```sql
SELECT meals.type, COUNT(meal_id) 
FROM meals 
INNER JOIN(
    select type, AVG(price) 
    FROM meals 
    GROUP BY type) 
    avgs on meals.type = avgs.type 
WHERE meals.price > avgs.avg 
GROUP BY meals.type
```
    
</p>
</details>

4. Calculate the percentage of users who come from each service. This query will look similar to doing a count of users with a `GROUP BY` on campaign_id, except you will have to divide by the total number of users.

    As is the case with many other programming languages, dividing an int by an int yields an int, and you will get 0 instead of something like 0.54. You can deal with this by casting one of the values as a real like this: `CAST (value AS REAL)`

    You should get the following result:
    
|campaign_id|percentage         |
|-----------|-------------------|
|FB         |0.39681390296886315|
|RE         |0.1560463432295438 |
|PI         |0.10644460535843592|
|TW         |0.3406951484431571 |

Your answer:   
   
SELECT campaign_id, CAST(COUNT(*) AS REAL)/(SELECT COUNT(*) FROM users) AS percentage     
FROM users u     
GROUP BY campaign_id    
      
(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT campaign_id, 
   CAST(COUNT(*) as REAL)/(SELECT COUNT(*) from users)
   as percentage 
FROM users 
GROUP BY campaign_id 
```
    
</p>
</details>

### Part 9: Window Functions
Aggregation functions reduce the number of rows down to the level defined by the values in the group by. But what if we don't want to reduce the number of rows, but still want to see the aggregation for each row? For instance, what if we would like to see the average price of Italian meals next to each Italian meal sold? We can use an `OVER` clause in conjunction with an aggregation function (for instance, `AVG()`) to do this.

```sql
SELECT e.*, m.price, avg(m.price) OVER () -- since the OVER clause is empty this will basically just be the average over all the rows in the returned dataset
from events e
join meals m on e.meal_id = m.meal_id
where m.type = 'italian' and e.event = 'bought'
order by e.dt asc
```

These types of functions are called window functions. We could accomplish the same thing using a subquery to find the average and then a join, but this is nice because we can do it in only one statement. However, the above query isn't very useful because we are specifying only the Italian meals and we'd like this to work on all types of meals. We can modify the window that the aggregation occurs on by adding `PARTITION BY` into the `OVER` clause and removing the 'italian' filter in the `WHERE` like so:
```sql
SELECT e.*, m.price, avg(m.price) OVER (partition by m.type) -- now the OVER is causing the avg function to work over windows that include each type of meal 
from events e
join meals m on e.meal_id = m.meal_id
where e.event = 'bought'
order by e.dt asc
```

Now what if we want to just see the average of the last 5 sales per meal type? We can redefine the frame so that it is smaller than all the rows using the `ROWS PRECEDING` and `FOLLOWING` arguments in the `OVER` clause. 
```sql
SELECT e.*, m.price, avg(m.price) over (partition by m.type rows between 5 preceding and current row) as avg_5 -- now we are getting an average that looks at the recent 5 rows
from events e
join meals m on e.meal_id = m.meal_id
where e.event = 'bought'
order by e.dt asc
```

Except that doesn't actually look at the most recent 5 meals! It just looks at the last 5 rows in some unhelpful order! We need to add in an order by so we average the correct rows, like this:
```sql
SELECT e.*, m.price, avg(m.price) over (partition by m.type order by m.type, e.dt rows between 5 preceding and current row) as avg_5 -- that looks at the correct 5 rows now that we are ordering them correctly by type of meal and event date
from events e
join meals m on e.meal_id = m.meal_id
where e.event = 'bought'
order by e.dt asc
``` 
It is important to notice that it doesn't matter to the window function what order by we use at the end of the query, it is just paying attention to the `OVER` clause that defines it and whatever `ORDER BY` subclause it finds there.

For more information, take a look at the post [here](https://tapoueh.org/blog/2013/08/understanding-window-functions/).

1. Use the [LAG](https://www.mysqltutorial.org/mysql-window-functions/mysql-lag-function/) window function to show the type of meal that a customer ordered before a given order. Your output should be as follows:

|userid|current_order_date|current_meal_type|last_meal_type|
|------|------------------|-----------------|--------------|
|1     |2013-01-21        |japanese         |french        |
|1     |2013-04-18        |french           |italian       |
|1     |2013-05-11        |italian          |japanese      |
|1     |2013-07-02        |japanese         |italian       |
|1     |2013-07-12        |italian          |chinese       |
|1     |2013-07-18        |chinese          |mexican       |
|1     |2013-07-28        |mexican          |chinese       |
|1     |2013-07-29        |chinese          |italian       |
|1     |2013-07-30        |italian          |french        |
|...|

Your answer:   
SELECT events.userid, events.dt curr_order_date, meals.TYPE curr_type, 
LAG(meals.TYPE, 1) OVER (PARTITION BY events.userid ORDER BY events.dt) prev_type     
FROM events       
JOIN meals ON events.meal_id = meals.meal_id    
WHERE events.event = 'bought'    
ORDER BY userid, events.dt asc     
     
(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT events.userid, meals.dt as  current_order_date, meals.type as current_meal_type, LAG(meals.type) OVER (partition by events.userid ORDER BY meals.dt DESC) as last_meal_type
FROM events
LEFT JOIN meals
ON (events.meal_id = meals.meal_id)
WHERE events.event = 'bought'
ORDER BY events.userid, meals.dt
```
    
</p>
</details>

2. For each event, show what percentage of the last 100 items that were of each type, sorting first by event, and then by type.

The query should output:

|event |type      |pct|
|------|----------|---|
|bought|chinese   |16 |
|bought|italian   |31 |
|bought|japanese  |22 |
|bought|mexican   |13 |
|bought|vietnamese|18 |
|like  |chinese   |15 |
|like  |italian   |34 |
|like  |japanese  |14 |
|like  |mexican   |14 |
|like  |vietnamese|23 |
|share |chinese   |18 |
|share |italian   |22 |
|share |japanese  |29 |
|share |mexican   |20 |
|share |vietnamese|11 |

Your answer:   
SELECT event, TYPE, count(event) AS pct     
FROM (SELECT *, ROW_NUMBER() OVER (PARTITION BY event ORDER BY events.dt DESC) AS e_sort   
FROM events     
INNER JOIN meals ON events.meal_id=meals.meal_id ) AS ordlist    
WHERE ordlist.e_sort<=100     
GROUP BY event , type     
ORDER BY EVENT , type    
        
(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT event, type, COUNT(event) as pct FROM 
(SELECT *, row_number() OVER (PARTITION BY event order BY events.dt desc) as rn
FROM events INNER JOIN meals on events.meal_id=meals.meal_id) as ordlist 
WHERE ordlist.rn<=100
GROUP BY event, type 
ORDER BY event, type
```
    
</p>
</details>

3. Use the [NTILE](https://www.sqltutorial.org/sql-window-functions/sql-ntile/) window function to show the top 10% of users by number of entries in the events table. Your output should be the following:

|userid|
|------|
|21    |
|112   |
|28    |
|75    |
|...|

Your answer:    
SELECT userid   
FROM (SELECT mc1.userid, NTILE(10) OVER(ORDER BY mc1.meal_count) AS count_ntile, mc1.meal_count    
     	FROM (SELECT userid, COUNT(meal_id) AS meal_count FROM events GROUP BY userid) AS mc1
	ORDER BY mc1.meal_count DESC) AS mc2   
WHERE count_ntile = 10


(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT userid from 
(SELECT mc1.userid, NTILE(10) OVER(ORDER BY mc1.meal_count) 
as count_ntile, mc1.meal_count
FROM
(SELECT userid, COUNT(meal_id) as meal_count  
FROM events
GROUP BY userid) as mc1
ORDER BY mc1.meal_count DESC) as mc2
WHERE count_ntile = 10
```
    
</p>
</details>

### Part 10: More practice (Extra Credit)

1. Answer the question, _"What user from each campaign bought the most items?"_

    It will be helpful to create a temporary table that contains the counts of the number of items each user bought. You can create a temporary table like this: `CREATE TEMPORARY TABLE mytable AS SELECT...`

Your answer:   

CREATE TEMPORARY TABLE temp AS 
(SELECT  users.userid, users.campaign_id, count(*)  AS num_bought
FROM events
INNER JOIN users ON USERS.userid=EVENTS.USERID
WHERE EVENT = 'bought'
GROUP BY USERS.userid, users.campaign_id);
SELECT temp.userid, temp.campaign_id, mx.highest_purchasers
FROM (SELECT campaign_id, max(num_bought) AS highest_purchasers FROM temp
	GROUP BY campaign_id) AS mx
INNER JOIN temp ON mx.highest_purchasers = temp.num_bought AND mx.campaign_id=temp.campaign_id
GROUP BY USER.campaign_id   

(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
CREATE TEMPORARY TABLE pc AS
(SELECT users.userid, users.campaign_id, count(*) AS nbought FROM events 
INNER JOIN users ON users.userid=events.userid 
WHERE event='bought' 
GROUP BY event,users.userid, users.campaign_id);
SELECT pc.userid, pc.campaign_id, mt.max_bought FROM
(SELECT campaign_id, max(nbought) AS max_bought FROM pc group by campaign_id) AS mt
INNER JOIN pc ON mt.max_bought=pc.nbought AND mt.campaign_id=pc.campaign_id
```
    
</p>
</details>

2. For each day, get the total number of users who have registered as of that day. You should get a table that has a `dt` and a `cnt` column. This is a cumulative sum.

Your answer: 

(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT dt, SUM(c) OVER (ORDER BY dt) AS cnt FROM 
(SELECT dt, COUNT(userid) AS c FROM users GROUP BY dt ORDER BY dt) AS usercount
ORDER BY dt
```
    
</p>
</details>

3. What day of the week has the most buys of meals?

Your answer: 

(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT dow,count(dow) FROM 
(SELECT to_char(dt,'dy') AS dow FROM events WHERE event='bought') AS dow_bevents
GROUP BY dow ORDER BY count DESC
```
    
</p>
</details>

4. Which month had the highest percent of users who visited the site purchase a meal?

Your answer: 

(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT month,avg(CASE WHEN event='bought' THEN 1 ELSE 0 END) AS average FROM 
(SELECT *, date_trunc('month', dt) AS month FROM events) AS tmonth
GROUP BY month
ORDER BY average DESC
```
    
</p>
</details>

5. Find all the meals that are above the average meal price of the previous seven days.

Your answer: 

(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
create temporary table if not exists prev_price_avg 
as select dt, tprice/trows as avprice_prev7 from
(select dt, 
sum(nrows) over (order by dt rows between 7 preceding and 1 preceding) as trows, 
sum(totalprice) over (order by dt rows between 7 preceding and 1 preceding) as tprice from 
(select dt, count(price) as nrows, sum(price) as totalprice from meals group by dt) as t1) as t2;
select meal_id, meals.dt, type, price, round(avprice_prev7,2) from meals inner join prev_price_avg on meals.dt=prev_price_avg.dt 
where price>avprice_prev7
order by meal_id
```
    
</p>
</details>

6. What percent of users have shared more meals than they have liked?

Your answer: 

(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
CREATE TEMPORARY TABLE IF NOT EXISTS t1 AS SELECT userid, COUNT(*) AS sharecount FROM events WHERE event='share' GROUP BY userid;
CREATE TEMPORARY TABLE IF NOT EXISTS t2 AS SELECT userid, COUNT(*) AS likecount FROM events WHERE event='like' GROUP BY userid;
SELECT AVG(CASE WHEN sharecount>likecount THEN 1 ELSE 0 END) FROM t1
INNER JOIN t2 ON t1.userid=t2.userid    
```
    
</p>
</details>

7. For every day, count the number of users who have visited the site and did not perform an action.

Your answer: 

(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT dt,COUNT(*) FROM 
(SELECT visits.dt, visits.userid FROM visits LEFT JOIN events ON visits.userid=events.userid AND visits.dt=events.dt WHERE events.dt IS NULL) AS t1
GROUP BY dt ORDER BY dt
```
    
</p>
</details>

8. Find all the dates with a greater than average number of meals.

Your answer: 

(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
CREATE TEMPORARY TABLE IF NOT EXISTS t1 as SELECT AVG(count) FROM 
(SELECT COUNT(*) FROM meals GROUP BY dt) AS t2;
SELECT dt, count FROM (SELECT dt,count(*) FROM meals GROUP BY dt) AS t3 CROSS JOIN t1 WHERE count>avg
```
    
</p>
</details>

9. Find all the users who bought a meal before liking or sharing a meal.

Your answer: 

(fill this in before checking the solution!!!)

<details><summary>Solution</summary>
<p>
    
```sql
SELECT t1.userid FROM 
    (SELECT userid, MIN(dt) AS firstls FROM events WHERE event='like' 
    OR event='share' GROUP BY userid) AS t1
INNER JOIN (SELECT userid, MIN(dt) AS firstb FROM events WHERE event='bought' GROUP BY userid) AS t2 ON t1.userid=t2.userid
WHERE firstb<firstls
ORDER BY userid
```
    
</p>
</details>

## SQL in Python Instructions

1. Make sure your docker PostgreSQL container is running using the "docker container ls" command.

2. Run "pip install psycopg2-binary". This includes all the C-based requirements and can save you some errors that sometimes occur when if you try to run "pip install psycopg2".

3. After installing psycopg2-binary you may import `psycopg2` and create a connection to the database with

    ```python
    import psycopg2 as pg2
    conn = pg2.connect(dbname='readychef',
                        host='localhost',
                        user='PostgreSQL',
                        password='galvanize')
    ```
4. Create a cursor from the connection and execute a query to select the first 10 rows from the event table. Use a `for` loop to iterate over the cursor, printing out each row.

5. Write a function that takes a query string and database connection, executes the query, and returns a list of rows. Call the function on a statement selecting the first 10 rows of the users table. Is it better for a function to return a list of rows or the cursor itself?

6. Use the `read_sql` function in `pandas` to load the same query into a dataframe.